In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import matplotlib
matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus']=False

In [3]:
df = pd.read_csv('data/grade.csv')
df

    학년  과목   결과  중간  기말
0  1학년  국어   좋음  80  90
1  1학년  국어   나쁨  50  40
2  1학년  국어   나쁨  20  50
3  1학년  수학   좋음  83  95
4  1학년  수학   좋음  93  86
5  2학년  국어   나쁨  44  65
6  2학년  국어   좋음  95  98
7  2학년  수학   좋음  96  99
8  2학년  수학   나쁨  57  69

In [6]:
df[['중간','기말']].sum()  # 나머지는 문자열

중간    618
기말    692
dtype: int64

~별 (집계)

## DataFrame Groupby : sum, mean, max, min, agg, count

In [10]:
g = df.groupby('학년')
# print(type(g))
g.sum()

      중간   기말
학년
1학년  326  361
2학년  292  331

In [11]:
g = df.groupby('학년')
g.mean()

       중간     기말
학년
1학년  65.2  72.20
2학년  73.0  82.75

In [13]:
g = df.groupby('학년')   # 문자열도 출력. ㄱㄴㄷ~ 중 높은거
g.max()[['중간','기말']]

     중간  기말
학년
1학년  93  95
2학년  96  99

In [14]:
g = df.groupby('학년')
g.min()[['중간','기말']]

     중간  기말
학년
1학년  20  40
2학년  44  65

In [16]:
g = df.groupby('학년')
g.count()

     과목  결과  중간  기말
학년
1학년   5   5   5   5
2학년   4   4   4   4

In [17]:
g = df.groupby('학년')
g.agg(['sum','mean']) # multi columns

      중간         기말
     sum  mean  sum   mean
학년
1학년  326  65.2  361  72.20
2학년  292  73.0  331  82.75

In [18]:
# 학년 및 과목별
g = df.groupby(['학년','과목'])
g.mean()

          중간    기말
학년  과목
1학년 국어  50.0  60.0
    수학  88.0  90.5
2학년 국어  69.5  81.5
    수학  76.5  84.0

## pivot_table, pd.pivot

In [19]:
df.pivot_table(index='학년')  # 평균값이 디폴트

        기말    중간
학년
1학년  72.20  65.2
2학년  82.75  73.0

In [20]:
df.pivot_table(index='학년',aggfunc='sum')

      기말   중간
학년
1학년  361  326
2학년  331  292

In [21]:
df.pivot_table(index=['학년','과목']) # 평균이 디폴트

          기말    중간
학년  과목
1학년 국어  60.0  50.0
    수학  90.5  88.0
2학년 국어  81.5  69.5
    수학  84.0  76.5

In [22]:
df.pivot_table(index=['학년','과목'],values='중간') # 평균이 디폴트

          중간
학년  과목
1학년 국어  50.0
    수학  88.0
2학년 국어  69.5
    수학  76.5

In [23]:
df.pivot_table(index=['학년','과목'],values=['중간','기말'])  #평균이 디폴트

          기말    중간
학년  과목
1학년 국어  60.0  50.0
    수학  90.5  88.0
2학년 국어  81.5  69.5
    수학  84.0  76.5

In [24]:
df.pivot_table(index=['학년','과목'],values='중간',columns='결과') # 평균이 디폴트라 결과별 평균값 나옴

결과        나쁨    좋음
학년  과목
1학년 국어  35.0  80.0
    수학   NaN  88.0
2학년 국어  44.0  95.0
    수학  57.0  96.0

In [25]:
df.pivot_table(index='학년',values='중간')  # 학년별 중간고사 평균

       중간
학년
1학년  65.2
2학년  73.0

In [26]:
def fn( v ):
    print('===========')
    print(v)
    print('===========')
    return v.mean()

In [27]:
df.pivot_table( index='학년', aggfunc=fn, values='중간')  # 학년별 중간고사 평균

===========
0    80
1    50
2    20
3    83
4    93
Name: 중간, dtype: int64
===========
===========
5    44
6    95
7    96
8    57
Name: 중간, dtype: int64
===========

       중간
학년
1학년  65.2
2학년  73.0

In [34]:
df.pivot_table(index='학년',values='중간',aggfunc=(lambda v: '합격' if v.mean()>=70 else '불합격'))

      중간
학년
1학년  불합격
2학년   합격

In [35]:
df.pivot_table(index='학년',aggfunc=(lambda v: '합격' if v.mean()>=70 else '불합격'),values=['중간','기말'])  # 컬럼 가나다순 정렬

     기말   중간
학년
1학년  합격  불합격
2학년  합격   합격

In [37]:
df.pivot_table(index='학년',aggfunc=(lambda v: '합격' if v.mean()>=70 else '불합격'),values=['중간','기말'])[['중간','기말']]  # 컬럼 원하는대로 정렬

      중간  기말
학년
1학년  불합격  합격
2학년   합격  합격

In [5]:
df

    학년  과목   결과  중간  기말
0  1학년  국어   좋음  80  90
1  1학년  국어   나쁨  50  40
2  1학년  국어   나쁨  20  50
3  1학년  수학   좋음  83  95
4  1학년  수학   좋음  93  86
5  2학년  국어   나쁨  44  65
6  2학년  국어   좋음  95  98
7  2학년  수학   좋음  96  99
8  2학년  수학   나쁨  57  69